---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsOffset
source: html/d9b628fb-c71f-388f-fec3-974f2ba25263.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsOffset Property

Identifies the offset of the angular dimensions.

## Syntax (C#)
```csharp
public double AngularDimensionsOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for angularDimensionsOffset must be between 0 and 30000 feet.